# Pandas
    1. A powerful package of Python for manipulating tables
    2. Built on top of numpy (previously covered)
    3. Save you a lot of effort from writingng code for manipulating, extracting, and deriving tables related information
    4. Easy visualization with Matplotlib (which will be covered in the next class) 
    
## Objectives:   
    1) load csv, xlsx files 
    2) drop, concatenate, groupby 
    3) data structures â€“ Series and DataFrame, so you will learn how to create Series and DataFrame

In [1]:
# import packages 
import numpy as np
import pandas as pd

### create a Series with index

In [2]:
data = pd.Series([0.25, 0.5, 0.75, 1.0])

In [3]:
data

0    0.25
1    0.50
2    0.75
3    1.00
dtype: float64

### create a Series with explicit index

In [4]:
data = pd.Series([0.25, 0.5, 0.75, 1.0], 
                index = ['a','b', 'c', 'd'])

In [5]:
data

a    0.25
b    0.50
c    0.75
d    1.00
dtype: float64

## access data from the series

In [6]:
data['b']

0.5

## Construct a DataFrame from a dictionary

In [7]:
dictionary={"Name" :["Alex","Bob","Cathy","Don","Emma","Frank"],
            "Age" :[15,40,30,60,19,25],
            "income" :[300,800,1000,850,100,250]}

In [8]:
df=pd.DataFrame(dictionary) #DataFrame

In [9]:
df

    Name  Age  income
0   Alex   15     300
1    Bob   40     800
2  Cathy   30    1000
3    Don   60     850
4   Emma   19     100
5  Frank   25     250

In [10]:
# check the first few rows of the DataFrame (default = the first 5 rows)
df.head()

    Name  Age  income
0   Alex   15     300
1    Bob   40     800
2  Cathy   30    1000
3    Don   60     850
4   Emma   19     100

In [11]:
# check the first 2 rows of the DataFrame
df.head(2)

   Name  Age  income
0  Alex   15     300
1   Bob   40     800

In [12]:
# check the last few rows of the DataFrame (default = the first 5 rows)
df.tail()

    Name  Age  income
1    Bob   40     800
2  Cathy   30    1000
3    Don   60     850
4   Emma   19     100
5  Frank   25     250

In [13]:
# check the columns of the DataFrame
df.columns

Index(['Name', 'Age', 'income'], dtype='object')

In [14]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    6 non-null      object
 1   Age     6 non-null      int64
 2   income  6 non-null      int64
dtypes: int64(2), object(1)
memory usage: 272.0+ bytes

In [15]:
df.dtypes

Name      object
Age        int64
income     int64
dtype: object

In [16]:
df.describe()

             Age       income
count   6.000000     6.000000
mean   31.500000   550.000000
std    16.477257   376.828874
min    15.000000   100.000000
25%    20.500000   262.500000
50%    27.500000   550.000000
75%    37.500000   837.500000
max    60.000000  1000.000000

In [17]:
# print column Name
df["Name"]

0     Alex
1      Bob
2    Cathy
3      Don
4     Emma
5    Frank
Name: Name, dtype: object

In [18]:
# alternative way to print column Name 
df.Name

0     Alex
1      Bob
2    Cathy
3      Don
4     Emma
5    Frank
Name: Name, dtype: object

In [19]:
# add a new column 
df["new_feature"]=[-1,-2,-3,-4,-5,-6]

In [20]:
df

    Name  Age  income  new_feature
0   Alex   15     300           -1
1    Bob   40     800           -2
2  Cathy   30    1000           -3
3    Don   60     850           -4
4   Emma   19     100           -5
5  Frank   25     250           -6

In [21]:
# print column Name 
df.loc[:,"Name"]

0     Alex
1      Bob
2    Cathy
3      Don
4     Emma
5    Frank
Name: Name, dtype: object

In [22]:
# print column from Name to income, rows from 2nd to 4th 
df.loc[1:3,"Name":"income"]

    Name  Age  income
1    Bob   40     800
2  Cathy   30    1000
3    Don   60     850

In [23]:
# reverse all the rows 
df.loc[::-1,:]

    Name  Age  income  new_feature
5  Frank   25     250           -6
4   Emma   19     100           -5
3    Don   60     850           -4
2  Cathy   30    1000           -3
1    Bob   40     800           -2
0   Alex   15     300           -1

In [24]:
# print columns before column Age 
df.loc[:,:"Age"]

    Name  Age
0   Alex   15
1    Bob   40
2  Cathy   30
3    Don   60
4   Emma   19
5  Frank   25

In [25]:
# print columns before 2nd column 
df.iloc[:,:2]

    Name  Age
0   Alex   15
1    Bob   40
2  Cathy   30
3    Don   60
4   Emma   19
5  Frank   25

### filtering

In [26]:
# check all the values in the column income, whether the value is larger than 500 or not. 
df.income>500

0    False
1     True
2     True
3     True
4    False
5    False
Name: income, dtype: bool

In [27]:
# find all the values whose income is larger than 500
df[df.income>500]

    Name  Age  income  new_feature
1    Bob   40     800           -2
2  Cathy   30    1000           -3
3    Don   60     850           -4

In [28]:
# check all the values in the column Age, whether the value is less than 35 or not. 
df.Age<35

0     True
1    False
2     True
3    False
4     True
5     True
Name: Age, dtype: bool

In [29]:
# find all the values whose age is less than 35
df[df.Age<35]

    Name  Age  income  new_feature
0   Alex   15     300           -1
2  Cathy   30    1000           -3
4   Emma   19     100           -5
5  Frank   25     250           -6

In [30]:
# find all the values whose income is larger than 500 and age is less than 35 
df[(df.income>500) & (df.Age<35)]

    Name  Age  income  new_feature
2  Cathy   30    1000           -3

### Simple calculation

In [31]:
df.income.mean()

550.0

In [32]:
np.mean(df.income)

550.0

In [33]:
df.income.sum()

3300

In [34]:
df.income.std()

376.82887362833543

In [35]:
df.income.median()

550.0

## drop

In [36]:
df

    Name  Age  income  new_feature
0   Alex   15     300           -1
1    Bob   40     800           -2
2  Cathy   30    1000           -3
3    Don   60     850           -4
4   Emma   19     100           -5
5  Frank   25     250           -6

In [37]:
# drop the "new_feature" column 
df = df.drop(["new_feature"],axis=1)

In [38]:
df

    Name  Age  income
0   Alex   15     300
1    Bob   40     800
2  Cathy   30    1000
3    Don   60     850
4   Emma   19     100
5  Frank   25     250

## concatenating two tables vertically

In [39]:
# make a new dataframe from original dataframe df
data1=df.head()

In [40]:
data1

    Name  Age  income
0   Alex   15     300
1    Bob   40     800
2  Cathy   30    1000
3    Don   60     850
4   Emma   19     100

In [41]:
# make another new dataframe from original dataframe df
data2=df.tail()

In [42]:
data2

    Name  Age  income
1    Bob   40     800
2  Cathy   30    1000
3    Don   60     850
4   Emma   19     100
5  Frank   25     250

In [43]:
# vertical concatenating
data_concat=pd.concat([data1,data2],axis=0)

In [44]:
data_concat

    Name  Age  income
0   Alex   15     300
1    Bob   40     800
2  Cathy   30    1000
3    Don   60     850
4   Emma   19     100
1    Bob   40     800
2  Cathy   30    1000
3    Don   60     850
4   Emma   19     100
5  Frank   25     250

## concatenating two tables horizontally

In [45]:
# make a new series from original dataframe df
Income = df.income

In [46]:
Income

0     300
1     800
2    1000
3     850
4     100
5     250
Name: income, dtype: int64

In [47]:
# make another new series from original dataframe df
age=df.Age

In [48]:
age

0    15
1    40
2    30
3    60
4    19
5    25
Name: Age, dtype: int64

In [49]:
# horizontal concatenating
data_h_concat=pd.concat([Income,age],axis=1)

In [50]:
data_h_concat

   income  Age
0     300   15
1     800   40
2    1000   30
3     850   60
4     100   19
5     250   25

## groupby

In [51]:
df = pd.DataFrame({'Object': ['A', 'A', 'A', 'B', 'B'], 'Speed': [380., 370., 321, 24., 26.]})

In [52]:
df

  Object  Speed
0      A  380.0
1      A  370.0
2      A  321.0
3      B   24.0
4      B   26.0

In [53]:
df.groupby(['Object']).mean()

        Speed
Object
A       357.0
B        25.0

In [54]:
df.groupby(['Object']).size()

Object
A    3
B    2
dtype: int64

In [55]:
df.groupby(['Object']).size().reset_index(name = 'count')

  Object  count
0      A      3
1      B      2

## Construct a DataFrame from numpy ndarray

In [56]:
df = pd.DataFrame(np.array([[1,2,3],[4,5,6]]), 
                  columns = ['a','b','c'])

In [57]:
df

   a  b  c
0  1  2  3
1  4  5  6

## load files

In [58]:
# load data from excel 
df_xlsx = pd.read_excel(r'data.xlsx')

In [59]:
df_xlsx

   x1  x2  y
0  -1   2  0
1   3   3  0
2   1   4  0
3   2   7  0
4   5   6  0
5   7   2  1
6   9   1  1
7   8   5  1
8   9   7  1
9  10   3  1

In [60]:
# load data from cvs file  
df_csv = pd.read_csv(r'data.csv')

In [61]:
df_csv

   x1  x2  y
0  -1   2  0
1   3   3  0
2   1   4  0
3   2   7  0
4   5   6  0
5   7   2  1
6   9   1  1
7   8   5  1
8   9   7  1
9  10   3  1

# Summary: 
 
    1) Learn how to create Series and DataFrame 
    2) Learn how to drop, vertically and horizontally concatenate, groupby 
    3) learn how to load cvs, xlsx files 
    4) Reference; https://pandas.pydata.org

## Next: matplotlib seaborn